<?php

return [
    
    'Type 0'  =>  '进货',
    'Type 1'  =>  '入库',
    'Type 11'  =>  '调拨入库',
    'Type 12'  =>  '盘盈入库',
    'Type 13'  =>  '退货入库',
    'Type 15'  =>  '其他入库',
    'Type 1111'  =>  '删除调拨入库',
    'Type 1211'  =>  '删除盘盈入库',
    'Type 1311'  =>  '删除退货入库',
    'Type 1511'  =>  '删除其他入库',



    'Type 2'  =>  '冲减',
    'Type 21'  =>  '入库冲减',
    'Type 23'  =>  '盘亏冲减',
    'Type 24'  =>  '过期冲减',
    'Type 25'  =>  '其他冲减',
    'Type 2111'  =>  '删除入库冲减',
    'Type 2311'  =>  '删除盘亏冲减',
    'Type 2411'  =>  '删除过期冲减',
    'Type 2511'  =>  '删除其他冲减',


    // 'Type 3'  =>  '退货',
    // 'Type 4'  =>  '调拨',
    
    'Type 5'  =>  '科室领料',
    'Type 6'  =>  '药房发药',
    'Type 7'  =>  '药房撤销发药',
    'Type 8'  =>  '科室领药',
    'Type 10'  =>  '删除进货',
    'Type 111'  =>  '删除入库',
    'Type 211'  =>  '删除冲减',
    'Type 511'  =>  '删除科室领料',
    'Type 811'  =>  '删除科室领药',
    'Changedetail name' => '产品变动明细表',

];